# IMPORTAR LIBRERIAS

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import src.sharks_functions as sf

# DESCARGAR EL DATA

In [2]:
sh_attacks = pd.read_csv('attacks.csv',encoding = 'ISO-8859-1')
"""Descargar los datos con los cuales vamos a trabajar """

'Descargar los datos con los cuales vamos a trabajar '

# MANIPULAR EL DATASET

In [3]:
sh_attacks.head(1)
"""Ver lo que analiza cada columna"""

'Ver lo que analiza cada columna'

In [4]:
columnas = list(sh_attacks.columns)

In [5]:
print(columnas)

['Case Number', 'Date', 'Year', 'Type', 'Country', 'Area', 'Location', 'Activity', 'Name', 'Sex ', 'Age', 'Injury', 'Fatal (Y/N)', 'Time', 'Species ', 'Investigator or Source', 'pdf', 'href formula', 'href', 'Case Number.1', 'Case Number.2', 'original order', 'Unnamed: 22', 'Unnamed: 23']

In [6]:
sh_attacks_copia = sh_attacks.copy()

In [7]:
sh_attacks_copia.head(1)

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
0,2018.06.25,25-Jun-2018,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,...,White shark,"R. Collier, GSAF",2018.06.25-Wolfe.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.25,2018.06.25,6303.0,NaN,NaN

In [8]:
columnas_nuevas = {columna: columna.replace(" ", "_") for columna in columnas}

In [9]:
sh_attacks_copia.rename(columns=columnas_nuevas, inplace=True)

In [10]:
sh_attacks_copia.head(1)

,Case_Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex_,...,Species_,Investigator_or_Source,pdf,href_formula,href,Case_Number.1,Case_Number.2,original_order,Unnamed:_22,Unnamed:_23
0,2018.06.25,25-Jun-2018,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,...,White shark,"R. Collier, GSAF",2018.06.25-Wolfe.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.25,2018.06.25,6303.0,NaN,NaN

In [11]:
sh_attacks2 = sh_attacks_copia[["Date","Year", "Type", "Country","Area", "Activity", "Sex_", "Age", "Injury", "Fatal_(Y/N)", "Time", "Species_", "Investigator_or_Source"]]

In [12]:
sh_attacks2.shape

(25723, 13)

# SELECCIONAR LOS DATOS CON LOS QUE TRABAJAR

In [13]:
sh_attacks3 = sh_attacks2.dropna(how="all")

In [14]:
sh_attacks3.shape

(6302, 13)

In [15]:
sh_attacks3.sample(2)

,Date,Year,Type,Country,Area,Activity,Sex_,Age,Injury,Fatal_(Y/N),Time,Species_,Investigator_or_Source
5883,Reported 18-Jun- 1874,1874.0,Unprovoked,MEXICO,Veracruz,Bathing,M,NaN,FATAL,Y,NaN,NaN,"The Times-Picayune, 6/18/1874"
1027,18-May-2010,2010.0,Unprovoked,VIETNAM,Binh Dinh Province,Swimming,F,60,Severe lacerations to left foot,N,18h00,20 to 30kg shark,"Thanh Nien, 5/21/2010"

In [16]:
sh_attacks3.Type.unique()

array(['Boating', 'Unprovoked', 'Invalid', 'Provoked', 'Questionable',
       'Sea Disaster', nan, 'Boat', 'Boatomg'], dtype=object)

In [17]:
sh_attacks3.Activity.unique()

array(['Paddling', 'Standing', 'Surfing', ...,
       'Crew swimming alongside their anchored ship',
       '4 men were bathing', 'Wreck of  large double sailing canoe'],
      dtype=object)

In [18]:
sh_attacks3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6302 entries, 0 to 6301
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Date                    6302 non-null   object
 1   Year                    6300 non-null   float64
 2   Type                    6298 non-null   object
 3   Country                 6252 non-null   object
 4   Area                    5847 non-null   object
 5   Activity                5758 non-null   object
 6   Sex_                    5737 non-null   object
 7   Age                     3471 non-null   object
 8   Injury                  6274 non-null   object
 9   Fatal_(Y/N)             5763 non-null   object
 10  Time                    2948 non-null   object
 11  Species_                3464 non-null   object
 12  Investigator_or_Source  6285 non-null   object
dtypes: float64(1), object(12)
memory usage: 689.3+ KB

In [19]:
sh_attacks3.isna().sum()

Date                         0
Year                         2
Type                         4
Country                     50
Area                       455
Activity                   544
Sex_                       565
Age                       2831
Injury                      28
Fatal_(Y/N)                539
Time                      3354
Species_                  2838
Investigator_or_Source      17
dtype: int64

In [20]:
sh_attacks4 = sh_attacks3.fillna("absent")

In [21]:
sh_attacks4.isna().sum()

Date                      0
Year                      0
Type                      0
Country                   0
Area                      0
Activity                  0
Sex_                      0
Age                       0
Injury                    0
Fatal_(Y/N)               0
Time                      0
Species_                  0
Investigator_or_Source    0
dtype: int64

In [22]:
sh_attacks4.sample(3)

,Date,Year,Type,Country,Area,Activity,Sex_,Age,Injury,Fatal_(Y/N),Time,Species_,Investigator_or_Source
3495,17-Dec-1967,1967.0,Unprovoked,AUSTRALIA,Victoria,Swimming,M,59,"FATAL, presumed taken by a shark, body not rec...",Y,A.M.,absent,"H. Edwards, p.137-138"
3945,01-Dec-1960,1960.0,Unprovoked,AUSTRALIA,Queensland,Fishing,M,absent,Bitten & survived,N,absent,"Bull shark, 1m","Sunday Mail, 3/27/1994, p.107"
3408,1970s,1970.0,Unprovoked,SRI LANKA,Western Province,Spearfishing / freediving,M,absent,Swim fins badly torn by the shark's teeth,N,absent,absent,R. I. DeSilva.GSAF

In [23]:
sh_attacks5 = sh_attacks4.drop_duplicates()

In [24]:
sh_attacks5.shape

(6296, 13)

In [25]:
sh_attacks6 = sh_attacks5.reset_index(drop=True)

In [26]:
sh_attacks6.tail(1)

,Date,Year,Type,Country,Area,Activity,Sex_,Age,Injury,Fatal_(Y/N),Time,Species_,Investigator_or_Source
6295,1845-1853,0.0,Unprovoked,CEYLON (SRI LANKA),Eastern Province,Swimming,M,15,"FATAL. ""Shark bit him in half, carrying away t...",Y,absent,absent,S.W. Baker

In [27]:
list_columnas = list(sh_attacks6.columns)

In [28]:
print(list_columnas)

['Date', 'Year', 'Type', 'Country', 'Area', 'Activity', 'Sex_', 'Age', 'Injury', 'Fatal_(Y/N)', 'Time', 'Species_', 'Investigator_or_Source']

In [29]:
Split_Date_df = sh_attacks6["Date"].str.split("-| ", expand = True)

In [30]:
display(Split_Date_df)

,0,1,2,3,4,5,6,7,8,9,10,11,12
0,25,Jun,2018,None,None,None,None,None,None,None,None,None,None
1,18,Jun,2018,None,None,None,None,None,None,None,None,None,None
2,09,Jun,2018,None,None,None,None,None,None,None,None,None,None
3,08,Jun,2018,None,None,None,None,None,None,None,None,None,None
4,04,Jun,2018,None,None,None,None,None,None,None,None,None,None
...,...,...,...,...,...,...,...,...,...,...,...,...,...
6291,Before,1903,None,None,None,None,None,None,None,None,None,None,None
6292,Before,1903,None,None,None,None,None,None,None,None,None,None,None
6293,1900,1905,None,None,None,None,None,None,None,None,None,None,None
6294,1883,1889,None,None,None,None,None,None,None,None,None,None,None
6295,1845,1853,None,None,None,None,None,None,None,None,None,None,None

In [42]:
col_names = ["x1", "x2", "x3", "x4", "x5", "x6", "x7", "x8", "x9", "x10", "x11", "x12", "x13"]

In [43]:
Split_Date_df2 = Split_Date_df(names = col_names, header = None)

TypeError: 'DataFrame' object is not callable

In [ ]:
Split_Date_df = pd.DataFrame(Split_Date_series)

In [ ]:
Split_Date_df.shape

In [ ]:
Split_Date_df.Date.len()

In [ ]:
New_dates = Split_Date_df["Date"].str.split(",")
data = New_dates.to_list()
Sep_date = ["Day", "Month", "Year"]
Sep_dates = pd.DataFrame(data, columns = Sep_date)

In [ ]:
if len(elemento) == 3:
        Meses.append(elemento[1])
    elif len(elemento) != 3:
        print("No month")